In [20]:
import pandas as pd

users = pd.read_csv(
    "../ml-1m/users.dat",
    sep="::",
    engine="python",
    names=["user_id", "gender", "age", "occupation", "zip_code"],
    encoding="latin-1"
)

users.head()

   user_id gender  age  occupation zip_code
0        1      F    1          10    48067
1        2      M   56          16    70072
2        3      M   25          15    55117
3        4      M   45           7    02460
4        5      M   25          20    55455

In [21]:
users.columns

Index(['user_id', 'gender', 'age', 'occupation', 'zip_code'], dtype='object')

In [22]:
print(len(users) == len(users['user_id'].unique()))

True

In [23]:
users['gender'].value_counts(dropna=False)

gender
M    4331
F    1709
Name: count, dtype: int64

In [24]:
from tabulate import tabulate

df = users
def columnValues(d):
    row = [d.nunique(), (d == 0).sum(axis=0), d.isna().sum(), round(d.isna().sum() / len(d) * 100, 1), d.dtypes]
    return row

cols = []
for column in df:
    cols.append([column] + columnValues(df[column]))

print(tabulate(cols, headers=['Column', 'Count Unique', 'Count Zeros', 'Count NaNs','% of NaNs', 'data type'], tablefmt='orgtbl'))

| Column     |   Count Unique |   Count Zeros |   Count NaNs |   % of NaNs | data type   |
|------------+----------------+---------------+--------------+-------------+-------------|
| user_id    |           6040 |             0 |            0 |           0 | int64       |
| gender     |              2 |             0 |            0 |           0 | object      |
| age        |              7 |             0 |            0 |           0 | int64       |
| occupation |             21 |           711 |            0 |           0 | int64       |
| zip_code   |           3439 |             0 |            0 |           0 | object      |

In [25]:
users['age'].value_counts(dropna=False)

age
25    2096
35    1193
18    1103
45     550
50     496
56     380
1      222
Name: count, dtype: int64

Возраст уже разделен на возрастные каиегории

	*  1:  "Under 18"
	* 18:  "18-24"
	* 25:  "25-34"
	* 35:  "35-44"
	* 45:  "45-49"
	* 50:  "50-55"
	* 56:  "56+"

In [26]:
age_map = {
    1:  "under_18",
    18: "18_24",
    25: "25_34",
    35: "35_44",
    45: "45_49",
    50: "50_55",
    56: "56_plus",
}

age_groups = pd.DataFrame({
    "group_id": range(1, len(age_map.keys()) + 1),
    "group_label": age_map.values(),
})

In [27]:
age_groups

   group_id group_label
0         1    under_18
1         2       18_24
2         3       25_34
3         4       35_44
4         5       45_49
5         6       50_55
6         7     56_plus

In [28]:
age_groups.to_csv("../age_groups.csv", index=False)

In [29]:
age_map = dict(
    zip(age_map.keys(), age_groups["group_id"])
)

users["age_group_id"] = users["age"].map(age_map)

In [30]:
users = users.drop("age", axis=1)

In [31]:
users

      user_id gender  occupation zip_code  age_group_id
0           1      F          10    48067             1
1           2      M          16    70072             7
2           3      M          15    55117             3
3           4      M           7    02460             5
4           5      M          20    55455             3
...       ...    ...         ...      ...           ...
6035     6036      F          15    32603             3
6036     6037      F           1    76006             5
6037     6038      F           1    14706             7
6038     6039      F           0    01060             5
6039     6040      M           6    11106             3

[6040 rows x 5 columns]

In [32]:
users['occupation'].value_counts(dropna=False)

occupation
4     759
0     711
7     679
1     528
17    502
12    388
14    302
20    281
2     267
16    241
6     236
10    195
3     173
15    144
13    142
11    129
5     112
9      92
19     72
18     70
8      17
Name: count, dtype: int64

In [33]:
occupation_map = {
    0: "Other",
    1: "Academic/Educator",
    2: "Artist",
    3: "Clerical/Admin",
    4: "College/Grad student",
    5: "Customer Service",
    6: "Doctor/Health care",
    7: "Executive/Managerial",
    8: "Farmer",
    9: "Homemaker",
    10: "K-12 student",
    11: "Lawyer",
    12: "Programmer",
    13: "Retired",
    14: "Sales/Marketing",
    15: "Scientist",
    16: "Self-employed",
    17: "Technician/engineer",
    18: "Tradesman/craftsman",
    19: "Unemployed",
    20: "Writer"
}

occupations = pd.DataFrame({
    "occ_id": range(1, len(occupation_map.keys()) + 1),
    "occ_name": occupation_map.values(),
})

occupations.to_csv("../occupations.csv", index=False)
occupations

    occ_id              occ_name
0        1                 Other
1        2     Academic/Educator
2        3                Artist
3        4        Clerical/Admin
4        5  College/Grad student
5        6      Customer Service
6        7    Doctor/Health care
7        8  Executive/Managerial
8        9                Farmer
9       10             Homemaker
10      11          K-12 student
11      12                Lawyer
12      13            Programmer
13      14               Retired
14      15       Sales/Marketing
15      16             Scientist
16      17         Self-employed
17      18   Technician/engineer
18      19   Tradesman/craftsman
19      20            Unemployed
20      21                Writer

In [34]:
occ_map = dict(
    zip(occupation_map.keys(), occupations["occ_id"])
)

users["occupation"] = users["occupation"].map(occ_map)
users

      user_id gender  occupation zip_code  age_group_id
0           1      F          11    48067             1
1           2      M          17    70072             7
2           3      M          16    55117             3
3           4      M           8    02460             5
4           5      M          21    55455             3
...       ...    ...         ...      ...           ...
6035     6036      F          16    32603             3
6036     6037      F           2    76006             5
6037     6038      F           2    14706             7
6038     6039      F           1    01060             5
6039     6040      M           7    11106             3

[6040 rows x 5 columns]

In [35]:
users['occupation'].value_counts()

occupation
5     759
1     711
8     679
2     528
18    502
13    388
15    302
21    281
3     267
17    241
7     236
11    195
4     173
16    144
14    142
12    129
6     112
10     92
20     72
19     70
9      17
Name: count, dtype: int64

In [36]:
users = users.drop("zip_code", axis=1)
users

      user_id gender  occupation  age_group_id
0           1      F          11             1
1           2      M          17             7
2           3      M          16             3
3           4      M           8             5
4           5      M          21             3
...       ...    ...         ...           ...
6035     6036      F          16             3
6036     6037      F           2             5
6037     6038      F           2             7
6038     6039      F           1             5
6039     6040      M           7             3

[6040 rows x 4 columns]

In [37]:
users.to_csv("../users.csv", index=False)